"""
集合是一种：无序、元素唯一的容器类型

不能直接写{}来定义空集合，因为直接写{}定义的是：空字典。
"""

s = {10, 20, 20, 30, 40, 40, 50, 60, 60, 70, 80, 90, 100}
print(type(s), s)  # <class 'set'> {100, 70, 40, 10, 80, 50, 20, 90, 60, 30}

# 不能直接写{}来定义空集合，因为直接写{}定义的是：空字典
s2 = {}
print(type(s2), s2)  # <class 'dict'> {}

# 借助内置的forzenset函数，实现不可变
s1 = frozenset({10, 20, 20, 30, 40, 40, 50, 60, 60, 70, 80, 90, 100})
print(type(s1), s1)  # <class 'frozenset'> frozenset({100, 70, 40, 10, 80, 50, 20, 90, 60, 30})

# 集合中不能嵌套【可变集合】，但可以嵌套【不可变集合】
# 通俗理解：只有“不可变”的东西，才能安全的放进集合里

