# 1. 新增

## 方法一：add()，向集合中添加元素，无返回值
s1 = {10, 20, 30, 40, 50}
s1.add(60)
print(s1)  # {50, 20, 40, 10, 60, 30}

## 方法二：update()，向集合中批量添加元素（接收可迭代对象），无返回值
s1 = {10, 20, 30, 40, 50}
s1.update([60, 70])
s1.update((80, 90))
s1.update({100, 200})
s1.update(range(300, 308))
print(s1)  # {70, 200, 10, 80, 20, 90, 30, 100, 40, 300, 301, 302, 303, 304, 305, 50, 306, 307, 60}

# 2. 删除

# 方法一：remove()，从集合中移除指定元素（若元素不存在，会报错），无返回值
s1 = {10, 20, 30, 40, 50}
s1.remove(20)
print(s1)  # {50, 40, 10, 30}

# 方法二：discard()，从集合中移除指定元素（若元素不存在，不会报错），无返回值
s1 = {10, 20, 30, 40, 50}
s1.discard(80)
print(s1)  # {50, 20, 40, 10, 30}

# 方法三：pop()，从集合中移除一个任意元素，返回值：移除的那个元素
s1 = {10, 20, 30, 40, 50}
result = s1.pop()
print(s1)  # {20, 40, 10, 30}
print(result)  # 50

# 方法四：clear()，清空集合，无返回值
s1 = {10, 20, 30, 40, 50}
s1.clear()
print(s1)  # set()

# 3. 修改
## 集合不支持修改，可以使用：remove+add的组合，来达到“修改”的效果。
s1 = {10, 20, 30, 40, 50}
s1.remove(20)
s1.add(66)
print(s1)  # {50, 66, 40, 10, 30}

# 4. 查询
## 由于集合没有下标，也不支持切片操作，所以集合不具备按位置访问的能力。
## 可以使用【成员运算符】来判断：某个元素是否在集合中
s1 = {10, 20, 30, 40, 50}
# s1[0] # 此行报错，因为集合不能通过下标访问元素
result = 20 not in s1 # False
print(result)
