# 1. 新增：字典[key] = 值
d1 = {'张三': 72, '李四': 60, '王五': 85}
d1['赵六'] = 100
print(d1)  # {'张三': 72, '李四': 60, '王五': 85, '赵六': 100}

# 2. 删除
# 删除指定key所对应的那组键值对
d1 = {'张三': 72, '李四': 60, '王五': 85}
del d1['张三']
print(d1)  # {'李四': 60, '王五': 85}

# 删除指定key所对应的那组键值对，并返回这个key所对应的值
d1 = {'张三': 72, '李四': 60, '王五': 85}
result = d1.pop('张三')
print(d1)  # {'李四': 60, '王五': 85}
print(result)  # 72

# pop方法可以设置默认值
# 默认值可以保证：当要删除的key不存在的情况下，程序不会报错，并且返回这个默认值
d1 = {'张三': 72, '李四': 60, '王五': 85}
result = d1.pop('奥特曼', '删除失败！')
print(d1)  # {'张三': 72, '李四': 60, '王五': 85}
print(result)  # 删除失败！

# 清空字典
d1.clear()
print(d1)  # {}

# 3. 修改
d1 = {'张三': 72, '李四': 60, '王五': 85}

# 修改的写法，与新增的写法一样，若字典中有对应的key，就是修改；若没有，就是新增
d1['张三'] = 97
print(d1)  # {'张三': 97, '李四': 60, '王五': 85}

# 批量修改
d1.update({'李四': 40, '王五': 67})
print(d1)  # {'张三': 97, '李四': 40, '王五': 67}

# 4. 查询
d1 = {'张三': 72, '李四': 60, '王五': 85}

# 直接取值，若键（key）不存在，会报错
result = d1['张三']

# 安全取值，若键（key）不存在，会返回默认值（若没有设置默认值，则会返回None）
result = d1.get('奥特曼', '抱歉，key不存在！')
print(result)
