# 1. index
# 查找指定元素在列表中第一次出现的下标，返回值是元素下标。
fruits = ["苹果", "香蕉", "桃子", "李子", "杏"]
print(fruits.index("桃子"))  # 2

# 2. count
# 统计某个元素在列表中出现的次数，返回值是：元素出现的次数。
# 不会嵌套找下一层的
nums = [10, 20, 10, 30, 10, 40, [10, 10, 10]]
result = nums.count(10)
print(result)  # 3

# 3. reserve
# 反转列表（会改变原列表），无需参数，无返回值
nums = [23, 11, 32, 30, 17, [6, 7, 8, 9]]
nums.reverse()
print(nums)  # [[6, 7, 8, 9], 17, 30, 32, 11, 23]

# 4. sort
# 对列表排序（从小到大，会改变原列表），reverse 用于控制排序方式，无返回值。
## 4.1 若列表中的元素：都是数字，则按照数字的大小顺序进行排序。
nums = [23, 11, 32, 30, 17]
nums.sort(reverse=True)
print(nums)  # [32, 30, 23, 17, 11]

# 4.2 若列表中的元素：既有数字，又有字符串，那就会报错。
nums = [23, 11, 32, 30, 17, '星露谷']
nums.sort()
# print(nums)  # TypeError
