"""
能连续存放元素的数据容器，而且元素有先后顺序，而且可以通过下标访问
列表、元组、字符串都是序列

语法格式：序列[起始索引:结束索引:步长]
注意点：
    1. 切片操作区域左闭右开
    2. 步长为取出元素的间隔
    3. 0~n-1，默认步长=1
    4. 当起始索引大于结束索引时，步长必须为负数，否则结果是空列表
"""
list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

list2 = list1[0:5:1]
print(list2)  # [10, 20, 30, 40, 50]

list2 = list1[1:8:2]
print(list2)  # [20, 40, 60, 80]

list2 = list1[1:8:3]
print(list2)  # [20, 50, 80]

list2 = list1[:]
print(list2)  # [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

list2 = list1[:999:]
print(list2)  # [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

list2 = list1[3::]
print(list2)  # [40, 50, 60, 70, 80, 90, 100]

list2 = list1[:5:]
print(list2)  # [10, 20, 30, 40, 50]

list2 = list1[::4]
print(list2)  # [10, 50, 90]

list2 = list1[7:2:-1]
print(list2)  # [80, 70, 60, 50, 40]

list2 = list1[::-1]
print(list2)  # [100, 90, 80, 70, 60, 50, 40, 30, 20, 10]

# 对元组进行切片
tuple1 = (10, 20, 30, 40, 50, 60, 70, 80, 90, 100)
tuple2 = tuple1[0:5:1]
print(tuple2)  # (10, 20, 30, 40, 50)

# 对字符串进行切片
msg1 = 'welcome to python'
msg2 = msg1[2:9:2]
print(msg2)  # loet
